Revit 2023 API
GeometryObject.Visibility Property
The visibility.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public Visibility Visibility { get; }
Visual Basic
Public ReadOnly Property Visibility As Visibility
	Get
Visual C++
public:
property Visibility Visibility {
	Visibility get ();
}
Remarks
The visibility of this object has no effect on the visibility of objects contained within this object. For example, the visibility of a Solid may be Contextual but the faces within that solid may still be Visible.
See Also
GeometryObject Class
Autodesk.Revit.DB Namespace